       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-DATA.
       COPY DATACPY.
       PROCEDURE DIVISION.
           DISPLAY WS-MESSAGE.
           STOP RUN.